const Tram = require("./../tramConstructor");

const tram = {
  number: "4a",
  stops:
    "Ул. Оломоуцкая, МЖК, Ул. Дружбы, Ул. Мира, Ул. Пушкина, Пивзавод, Изопан, РМЦ-2, ЭСПЦ, Промплощадка, ТПЦ-3, Жилгородок, ККЦ (Гаражи), ГЭТ, ТПЦ-2, Трубный завод, ПМК, ВПЗ-15, Завод напитков, Промбаза, Бетонный завод, Стройиндустрия, Ул. Пушкина, Школа РОСТО, Ул. Коммунистическая, Ул. Комсомольская, Ул. Ленинградская, Общежитие, Ул. Логинова",
  intervals: [],
  weekdays: {
    departures: {
      forward:
        "6-11, 6-27, 6-41, 7-13, 7-21, 7-47, 8-07, 8-25, 8-53, 9-02, 9-45 9-56, 10-36, 11-34, 12-15, 13-12, 13-48, 14-21, 14-50, 15-06, 15-25,15-45, 16-02, 16-26, 16-46, 17-05, 17-22, 17-42, 18-24 18-37, 19-37, 20-33",
      back:
        "6-59, 7-18, 7-35, 8-03, 8-13, 8-38, 8-58, 9-13, 9-50 10-44, 11-30, 12-22, 13-01, 14-00, 14-37, 14-55, 15-13,15-38, 15-55, 16-16, 16-50, 17-15, 17-36, 17-50, 18-49, 19-45."
    }
  },
  saturdays: {
    departures: {
      forward:
        "6-09, 6-55, 7-48, 8-34, 9-23,10-08, 11-25, 12-17, 13-04, 13-55, 14-50, 15-35, 15-44, 16-27, 17-14, 19-37, 20-32.",
      back:
        "6-58, 7-44, 8-36, 9-22, 10-37, 11-30,12-12, 13-04,13-56,14-43,15-43,16-26, 17-14, 18-40, 19-45, 20-32."
    }
  },
  sundays: {
    departures: {
      forward:
        "6-09, 6-54, 7-43, 8-28, 9-14, 10-41, 11-25, 12-15, 13-06, 13-55, 14-45, 15-38, 16-26, 17-11,18-40, 19-25, 19-32, 20-35, 21-10, 22-10, 22-47",
      back:
        "6-58, 7-42, 8-27, 9-18, 10-37, 11-28, 12-14, 13-03, 13-56,14-05, 14-50, 15-37, 16-26, 17-14 , 18-34, 19-45, 20-17, 21-23, 21-59"
    }
  }
};

module.exports = new Tram(tram);
