const Tram = require("./../tramConstructor");

const tram = {
  number: "4",
  stops:
    "Ул. Карбышева, Ул. Дружбы, Ул. Мира, Ул. Пушкина, Пивзавод, Изопан, РМЦ-2, ЭСПЦ, Промплощадка, ТПЦ-3, Жилгородок, ККЦ (Гаражи), ГЭТ, ТПЦ-2, Трубный завод, ПМК, ВПЗ-15, Завод напитков, Промбаза, Бетонный завод, Стройиндустрия, Ул. Пушкина, Школа РОСТО, Ул. Коммунистическая, Ул. Комсомольская, Ул. Ленинградская, Общежитие, Ул. Логинова",
  intervals: [],
  weekdays: {
    departures: {
      forward:
        "	5-30, 6-02, 6-18 , 6-35, 7-05, 7-29, 7-40, 7-55, 8-15, 8-44, 9-09, 9-19, 9-52, 10-09, 11-17, 11-50, 13-01, 14-32, 14-39,15-16, 15-36, 15-55, 16-15, 16-36, 16-54, 17-13, 17-31, 17-51, 18-11, 18-49",
      back:
        "6-17, 6-48, 7-06, 7-27, 7-55, 8-20, 8-30, 9-06, 9-23, 10-26, 10-59, 12-09, 12-38, 13-47, 14-24, 15-02, 15-28, 15-49, 16-06,16-26, 16-33, 16-44, 17-03, 17-23, 17-43, 18-02, 18-19, 18-38, 19-00"
    }
  },
  saturdays: {
    departures: {
      forward:
        "6-34, 7-18, 8-12, 8-58, 10-56, 11-47, 12-43, 13-28, 14-22, 15-13, 15-58, 17-32, 18-18, 19-00",
      back:
        "6-32, 7-24, 8-09, 9-50, 10-52, 11-56, 12-37, 13-32(через СВ), 14-20, 15-10, 16-46, 17-34, 18-15, 19-02"
    }
  },
  sundays: {
    departures: {
      forward:
        "6-27, 7-18, 8-07, 8-55, 9-37, 10-31,11-09, 11-52, 12-39, 13-26 , 14-15, 15-11, 15-57, 16-51, 18-33 ",
      back:
        "6-32, 7-16, 8-06, 8-52, 9-43, 10-23, 12-39, 13-31, 15-11, 16-03, 16-50, 17-47."
    }
  }
};

module.exports = new Tram(tram);
