const Tram = require("./../tramConstructor");

const tram = {
  number: "1",
  stops:
    "Ул. Логинова, Общежитие, Ул. Ленинградская, Ул. Комсомольская, Ул. Коммунистическая, Школа РОСТО, Ул. Пушкина, Стройиндустрия, Бетонный завод, Промбаза, Завод напитков, ВПЗ-15, ПМК, Трубный завод, ТПЦ-2, ГЭТ, УТЭП, ТЭЦ-1, Завод СК, Шинный завод, Механический завод, Химволокно",
  intervals: [],
  weekdays: {
    departures: {
      forward:
        "5-42, 6-07, 6-30, 6-56, 7-10, 7-23, 7-42, 8-09, 8-24, 8-53, 13-40,14-49,15-23, 15-58,16-40, 16-57, 17-11, 17-32, 18-29, 21-30, 22-49",
      back:
        "6-20, 6-45, 7-05, 7-33, 7-47, 8-19, 14-14,14-46,15-22,16-03,16-21,16-33,16-56, 17-19,17-33,17-48,18-12,19-05, 21-58, 23-25"
    }
  },
  saturdays: {
    departures: {
      forward: "5-45, 6-42, 7-06, 8-17, 13-32, 21-20",
      back: "6-32, 7-17, 7-42, 8-20, 23-25"
    }
  },
  sundays: {
    departures: {
      forward: "6-08, 6-43, 7-25, 18-08, 21-30, 22-40",
      back: "6-47, 7-20, 22-04"
    }
  }
};

module.exports = new Tram(tram);
