const Tram = require("./../tramConstructor");

const tram = {
  number: "2",
  stops:
    "Пос. Рабочий, Пр. Ленина, Ул. Королева, Клуб Ровесник, Пл. Карбышева, 9 микрорайон, Ул. Химиков, ВПЗ-15, ПМК, Трубный завод, ТПЦ-2, ГЭС, УТЭП, ТЭЦ-1, Завод СК, Шинный завод, Механический завод, Химволокно, ВНТК, РШРЗ, Минстрой, Почтовый ящик, Уч. Центр, Подсобное хоз-во, Оргсинтез",
  intervals: [],
  weekdays: {
    departures: {
      forward:
        "6-03, 6-28, 6-53, 7-10, 7-40, 8-04, 8-27, 8-48, 9-18; 14-49, 16-09, 16-23, 16-46, 17-57, 18-40",
      back:
        "	6-52, 7-16, 7-40, 8-00, 8-28, 8-51, 9-12, 9-37, 10-03, 13-55, 14-53, 15-18, 15-36, 15-57, 16-34, 16-58, 17-15, 17-38, 18-46, 19-26"
    }
  },
  saturdays: {},
  sundays: {}
};

module.exports = new Tram(tram);
